org/qmckl.org
#+TITLE: Introduction
#+PROPERTY: comments org
#+SETUPFILE: ../tools/theme.setup
# -*- mode: org -*-

* Using QMCkl

The =qmckl.h= header file installed in the =${prefix}/include= directory
has to be included in C codes when QMCkl functions are used:

#+begin_src c :tangle no
#include "qmckl.h"
#+end_src

In Fortran programs, the =qmckl_f.f90= installed in
=${prefix}/share/qmckl/fortran= interface file should be copied in the source
code using the library, and the Fortran codes should use the ~qmckl~ module as

#+begin_src f90 :tangle no
use qmckl
#+end_src

Both files are located in the =include/= directory.

* Developing in QMCkl

** Literate programming

   In a traditional source code, most of the lines of source files of a program
   are code, scripts, Makefiles, and only a few lines are comments explaining
   parts of the code that are non-trivial to understand. The documentation of
   the prorgam is usually written in a separate directory, and is often outdated
   compared to the code.

   Literate programming is a different approach to programming,
   where the program is considered as a publishable-quality document. Most of
   the lines of the source files are text, mathematical formulas, tables,
   figures, /etc/, and the lines of code are just the translation in a computer
   language of the ideas and algorithms expressed in the text. More importantly,
   the "document" is structured like a text document with sections, subsections,
   a bibliography, a table of contents /etc/, and the place where pieces of code
   appear are the places where they should belong for the reader to understand
   the logic of the program, not the places where the compiler expects to find
   them. Both the publishable-quality document and the binary executable are
   produced from the same source files.

   Literate programming is particularly well adapted in this context, as the
   central part of this project is the documentation of an API. The
   implementation of the algorithms is just an expression of the algorithms in a
   language that can be compiled, so that the correctness of the algorithms can
   be tested.

   We have chosen to write the source files in [[https://karl-voit.at/2017/09/23/orgmode-as-markup-only/][org-mode]] format,
   as any text editor can be used to edit org-mode files. To
   produce the documentation, there exists multiple possibilities to convert
   org-mode files into different formats such as HTML or PDF. The source code is
   easily extracted from the org-mode files invoking the Emacs text editor from
   the command-line in the =Makefile=, and then the produced files are compiled.
   Moreover, within the Emacs text editor the source code blocks can be executed
   interactively, in the same spirit as Jupyter notebooks.

** Source code editing

   For a tutorial on literate programming with org-mode, follow [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][this link]].

   Any text  editor can be used  to edit org-mode files.  For a better
   user experience Emacs  is recommended.  For users  hating Emacs, it
   is good to  know that Emacs can behave like  Vim when switched into
   ``Evil''  mode.

   In the =tools/init.el= file, we provide a minimal Emacs configuration
   file for vim users. This file should be copied into =.emacs.d/init.el=.

   For users  with a preference  for Jupyter notebooks, we also provide the
   =tools/nb_to_org.sh= script can convert jupyter notebooks into org-mode
   files.

   Note that pandoc can be used to convert multiple markdown formats into
   org-mode.

** Choice of the programming language

    Most of the codes of the [[https://trex-coe.eu][TREX CoE]] are written in Fortran with some scripts in
    Bash and Python. Outside of the CoE, Fortran is also important (Casino, Amolqc),
    and other important languages used by the community are C and C++ (QMCPack,
    QWalk), and Julia is gaining in popularity. The library we design should be
    compatible with all of these languages.  The QMCkl API has to be compatible
    with the C language since libraries with a C-compatible API can be used in
    every other language.

    High-performance versions of the QMCkl, with the same API, will be rewritten by
    the experts in HPC. These optimized libraries will be tuned for specific
    architectures, among which we can cite x86 based processors, and GPU
    accelerators.  Nowadays, the most efficient software tools to take advantage of
    low-level features of the processor (intrinsics) and of GPUs are for C++
    developers. It is highly probable that the optimized implementations will be
    written in C++, and this is agreement with our choice to make the API
    C-compatible.

    Fortran is one of the most common languages used by the community, and is simple
    enough to make the algorithms readable both by experts in QMC, and experts in
    HPC. Hence we propose in this pedagogical implementation of QMCkl to use Fortran
    to express the QMC algorithms. As the main languages of the library is C, this
    implies that the exposed C functions call the Fortran routine.  However, for
    internal functions related to system programming, the C language is more natural
    than Fortran.

    The Fortran source files should provide a C interface using the
    ~iso_c_binding~ module. The name of the Fortran source files should end with
    =_f.f90= to be properly handled by the =Makefile=.  The names of the functions
    defined in Fortran should be the same as those exposed in the API suffixed by
    =_f=.

    For more guidelines on using Fortran to generate a C interface, see
    [[http://fortranwiki.org/fortran/show/Generating+C+Interfaces][this link]].

** Coding rules

   The authors should follow the recommendations of the C99
   [[https://wiki.sei.cmu.edu/confluence/display/c/SEI+CERT+C+Coding+Standard][SEI+CERT C Coding Standard]].

   Compliance can be checked with =cppcheck= as:

   #+begin_src bash
cppcheck --addon=cert --enable=all *.c &> cppcheck.out
   #+end_src

