qmckl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-17 Sun 16:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX CoE" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Introduction</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c91c6b">1. Using QMCkl</a></li>
<li><a href="#org2dd397b">2. Developing in QMCkl</a>
<ul>
<li><a href="#org1b5b890">2.1. Literate programming</a></li>
<li><a href="#orge17a3c0">2.2. Source code editing</a></li>
<li><a href="#orgef54390">2.3. Choice of the programming language</a></li>
<li><a href="#orgd5b31e0">2.4. Coding rules</a></li>
<li><a href="#org29bd8bf">2.5. Design of the library</a></li>
<li><a href="#org3a70408">2.6. Naming conventions</a></li>
<li><a href="#orge725199">2.7. Application programming interface</a></li>
<li><a href="#org09d5623">2.8. Global state</a></li>
<li><a href="#org2de979b">2.9. Headers</a></li>
<li><a href="#org5da2472">2.10. Low-level functions</a></li>
<li><a href="#org210aa1f">2.11. High-level functions</a></li>
<li><a href="#org0176a87">2.12. Numerical precision</a></li>
<li><a href="#org92c22d5">2.13. Algorithms</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1c91c6b" class="outline-2">
<h2 id="org1c91c6b"><span class="section-number-2">1</span> Using QMCkl</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>qmckl.h</code> header file installed in the <code>${prefix}/include</code> directory
has to be included in C codes when QMCkl functions are used:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"qmckl.h"</span>
</pre>
</div>

<p>
In Fortran programs, the <code>qmckl_f.f90</code> installed in
<code>${prefix}/share/qmckl/fortran</code> interface file should be copied in the source
code using the library, and the Fortran codes should use the <code>qmckl</code> module as
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
</pre>
</div>

<p>
Both files are located in the <code>include/</code> directory.
</p>
</div>
</div>

<div id="outline-container-org2dd397b" class="outline-2">
<h2 id="org2dd397b"><span class="section-number-2">2</span> Developing in QMCkl</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1b5b890" class="outline-3">
<h3 id="org1b5b890"><span class="section-number-3">2.1</span> Literate programming</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In a traditional source code, most of the lines of source files of a program
are code, scripts, Makefiles, and only a few lines are comments explaining
parts of the code that are non-trivial to understand. The documentation of
the prorgam is usually written in a separate directory, and is often outdated
compared to the code.
</p>

<p>
Literate programming is a different approach to programming,
where the program is considered as a publishable-quality document. Most of
the lines of the source files are text, mathematical formulas, tables,
figures, <i>etc</i>, and the lines of code are just the translation in a computer
language of the ideas and algorithms expressed in the text. More importantly,
the "document" is structured like a text document with sections, subsections,
a bibliography, a table of contents <i>etc</i>, and the place where pieces of code
appear are the places where they should belong for the reader to understand
the logic of the program, not the places where the compiler expects to find
them. Both the publishable-quality document and the binary executable are
produced from the same source files.
</p>

<p>
Literate programming is particularly well adapted in this context, as the
central part of this project is the documentation of an API. The
implementation of the algorithms is just an expression of the algorithms in a
language that can be compiled, so that the correctness of the algorithms can
be tested.
</p>

<p>
We have chosen to write the source files in <a href="https://karl-voit.at/2017/09/23/orgmode-as-markup-only/">org-mode</a> format,
as any text editor can be used to edit org-mode files. To
produce the documentation, there exists multiple possibilities to convert
org-mode files into different formats such as HTML or PDF. The source code is
easily extracted from the org-mode files invoking the Emacs text editor from
the command-line in the <code>Makefile</code>, and then the produced files are compiled.
Moreover, within the Emacs text editor the source code blocks can be executed
interactively, in the same spirit as Jupyter notebooks.
</p>
</div>
</div>

<div id="outline-container-orge17a3c0" class="outline-3">
<h3 id="orge17a3c0"><span class="section-number-3">2.2</span> Source code editing</h3>
<div class="outline-text-3" id="text-2-2">
<p>
For a tutorial on literate programming with org-mode, follow <a href="http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html">this link</a>.
</p>

<p>
Any text  editor can be used  to edit org-mode files.  For a better
user experience Emacs  is recommended.  For users  hating Emacs, it
is good to  know that Emacs can behave like  Vim when switched into
``Evil''  mode.
</p>

<p>
In the <code>tools/init.el</code> file, we provide a minimal Emacs configuration
file for vim users. This file should be copied into <code>.emacs.d/init.el</code>.
</p>

<p>
For users  with a preference  for Jupyter notebooks, we also provide the
<code>tools/nb_to_org.sh</code> script can convert jupyter notebooks into org-mode
files.
</p>

<p>
Note that pandoc can be used to convert multiple markdown formats into
org-mode.
</p>
</div>
</div>

<div id="outline-container-orgef54390" class="outline-3">
<h3 id="orgef54390"><span class="section-number-3">2.3</span> Choice of the programming language</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Most of the codes of the <a href="https://trex-coe.eu">TREX CoE</a> are written in Fortran with some scripts in
Bash and Python. Outside of the CoE, Fortran is also important (Casino, Amolqc),
and other important languages used by the community are C and C++ (QMCPack,
QWalk), and Julia is gaining in popularity. The library we design should be
compatible with all of these languages.  The QMCkl API has to be compatible
with the C language since libraries with a C-compatible API can be used in
every other language.
</p>

<p>
High-performance versions of the QMCkl, with the same API, will be rewritten by
the experts in HPC. These optimized libraries will be tuned for specific
architectures, among which we can cite x86 based processors, and GPU
accelerators.  Nowadays, the most efficient software tools to take advantage of
low-level features of the processor (intrinsics) and of GPUs are for C++
developers. It is highly probable that the optimized implementations will be
written in C++, and this is agreement with our choice to make the API
C-compatible.
</p>

<p>
Fortran is one of the most common languages used by the community, and is simple
enough to make the algorithms readable both by experts in QMC, and experts in
HPC. Hence we propose in this pedagogical implementation of QMCkl to use Fortran
to express the QMC algorithms. As the main languages of the library is C, this
implies that the exposed C functions call the Fortran routine.  However, for
internal functions related to system programming, the C language is more natural
than Fortran.
</p>

<p>
The Fortran source files should provide a C interface using the
<code>iso_c_binding</code> module. The name of the Fortran source files should end with
<code>_f.f90</code> to be properly handled by the <code>Makefile</code>.  The names of the functions
defined in Fortran should be the same as those exposed in the API suffixed by
<code>_f</code>.
</p>

<p>
For more guidelines on using Fortran to generate a C interface, see
<a href="http://fortranwiki.org/fortran/show/Generating+C+Interfaces">this link</a>.
</p>
</div>
</div>

<div id="outline-container-orgd5b31e0" class="outline-3">
<h3 id="orgd5b31e0"><span class="section-number-3">2.4</span> Coding rules</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The authors should follow the recommendations of the C99
<a href="https://wiki.sei.cmu.edu/confluence/display/c/SEI+CERT+C+Coding+Standard">SEI+CERT C Coding Standard</a>.
</p>

<p>
Compliance can be checked with <code>cppcheck</code> as:
</p>

<div class="org-src-container">
<pre class="src src-bash">cppcheck --addon=cert --enable=all *.c &amp;&gt; cppcheck.out
</pre>
</div>
</div>
</div>
