org/qmckl.org
** Design of the library

   The proposed API should allow the library to: deal with memory transfers
   between CPU and accelerators, and to use different levels of floating-point
   precision.  We chose a multi-layered design with low-level and high-level
   functions (see below).

** Naming conventions

   To avoid namespace collisions, we use =qmckl_= as a prefix for all exported
   functions and variables.  All exported header files should have a file name
   prefixed with =qmckl_=.

   If the  name of the  org-mode file is  =xxx.org=, the name  of the
   produced C files should be =xxx.c= and =xxx.h= and the name of the
   produced Fortran file should be =xxx.f90=.

   Arrays are in uppercase and scalars are in lowercase.

   In the  names of  the variables and  functions, only  the singular
   form is allowed.

** Application programming interface

   In the C language, the number of bits used by the integer types can change
   from one architecture to another one. To circumvent this problem, we choose to
   use the integer types defined in ~<stdint.h>~ where the number of bits used for
   the integers are fixed.

   To ensure that the library will be easily usable in /any/ other language
   than C, we restrict the data types in the interfaces to the following:
   - 32-bit and 64-bit integers, scalars and and arrays (~int32_t~ and ~int64_t~)
   - 32-bit and 64-bit floats, scalars and and arrays (~float~ and ~double~)
   - Pointers are always casted into 64-bit integers, even on legacy 32-bit architectures
   - ASCII strings are represented as a pointers to character arrays
     and terminated by a ~'\0'~ character (C convention).
   - Complex numbers can be represented by an array of 2 floats.
   - Boolean variables are stored as integers, ~1~ for ~true~ and ~0~ for ~false~
   - Floating point variables should be by default ~double~ unless explicitly mentioned
   - integers used for counting should always be ~int64_t~

   To facilitate the  use in other languages than C, we will provide some
   bindings in other languages in other repositories.

   # TODO : Link to repositories for bindings
   # To facilitate the  use in other languages than C,  we provide some
   # bindings in other languages in other repositories.

** Global state

   Global variables should  be avoided in the library,  because it is
   possible that one  single program needs to  use multiple instances
   of the library. To solve this  problem we propose to use a pointer
   to  a   [[./qmckl_context.html][=context=]] variable,  built   by  the  library   with  the
   =qmckl_context_create= function. The <<<=context=>>> contains the global
   state of  the library, and is  used as the first  argument of many
   QMCkl functions.

   The internal structure of the context  is not specified, to give a
   maximum of  freedom to  the different  implementations.  Modifying
   the  state   is  done   by  setters   and  getters,   prefixed  by
   =qmckl_set_=  an  =qmckl_get_=.

** Headers

   A single =qmckl.h= header to be distributed by the library
   is built by concatenating some of the produced header files.
   To facilitate building the =qmckl.h= file, we separate types from
   function declarations in headers. Types should be defined in header
   files suffixed by =_type.h=, and functions in files suffixed by
   =_func.h=.
   As these files will be concatenated in a single file, they should
   not be guarded by ~#ifndef *_H~, and they should not include other
   produced headers.

   Some particular types that are not exported need to be known by the
   context, and there are some functions to update instances of these
   types contained inside the context. For example, a
   ~qmckl_numprec_struct~ is present in the context, and the function
   ~qmckl_set_numprec_range~ takes a context as a parameter, and set a
   value in the ~qmckl_numprec_struct~ contained in the context.
   Because of these intricate dependencies, a private header is
   created, containing the ~qmckl_numprec_struct~. This header is
   included in the private header file which defines the type of the
   context. Header files for private types are suffixed by =_private_type.h=
   and header files for private functions are suffixed by =_private_func.h=.
   Fortran interfaces should also be written in the =*fh_func.f90= file,
   and the types definitions should be written in the =*fh_type.f90= file.

   | File               | Scope   | Description                  |
   |--------------------+---------+------------------------------|
   | =*_type.h=         | Public  | Type definitions             |
   | =*_func.h=         | Public  | Function definitions         |
   | =*_private_type.h= | Private | Type definitions             |
   | =*_private_func.h= | Private | Function definitions         |
   | =*fh_type.f90=     | Public  | Fortran type definitions     |
   | =*fh_func.f90=     | Public  | Fortran function definitions |

** Low-level functions

   Low-level functions are very simple  functions which are leaves of
   the function call tree (they don't call any other QMCkl function).

   These  functions   are   /pure/,   and  unaware   of   the   QMCkl
   =context=. They are not allowed to allocate/deallocate memory, and
   if they need temporary memory it should be provided in input.

** High-level functions

   High-level functions  are at  the top of  the function  call tree.
   They  are  able  to  choose which  lower-level  function  to  call
   depending on the required precision, and do the corresponding type
   conversions.  These functions are  also responsible for allocating
   temporary storage, to simplify the use of accelerators.

   The high-level  functions should be pure,  unless the introduction
   of non-purity is justified. All the side effects should be made in
   the =context= variable.

   # TODO : We need an identifier for impure functions
   # Suggestion (VJ): using *_unsafe_* for impure functions ?

