qmckl.html

<div id="outline-container-org29bd8bf" class="outline-3">
<h3 id="org29bd8bf"><span class="section-number-3">2.5</span> Design of the library</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The proposed API should allow the library to: deal with memory transfers
between CPU and accelerators, and to use different levels of floating-point
precision.  We chose a multi-layered design with low-level and high-level
functions (see below).
</p>
</div>
</div>

<div id="outline-container-org3a70408" class="outline-3">
<h3 id="org3a70408"><span class="section-number-3">2.6</span> Naming conventions</h3>
<div class="outline-text-3" id="text-2-6">
<p>
To avoid namespace collisions, we use <code>qmckl_</code> as a prefix for all exported
functions and variables.  All exported header files should have a file name
prefixed with <code>qmckl_</code>.
</p>

<p>
If the  name of the  org-mode file is  <code>xxx.org</code>, the name  of the
produced C files should be <code>xxx.c</code> and <code>xxx.h</code> and the name of the
produced Fortran file should be <code>xxx.f90</code>.
</p>

<p>
Arrays are in uppercase and scalars are in lowercase.
</p>

<p>
In the  names of  the variables and  functions, only  the singular
form is allowed.
</p>
</div>
</div>

<div id="outline-container-orge725199" class="outline-3">
<h3 id="orge725199"><span class="section-number-3">2.7</span> Application programming interface</h3>
<div class="outline-text-3" id="text-2-7">
<p>
In the C language, the number of bits used by the integer types can change
from one architecture to another one. To circumvent this problem, we choose to
use the integer types defined in <code>&lt;stdint.h&gt;</code> where the number of bits used for
the integers are fixed.
</p>

<p>
To ensure that the library will be easily usable in <i>any</i> other language
than C, we restrict the data types in the interfaces to the following:
</p>
<ul class="org-ul">
<li>32-bit and 64-bit integers, scalars and and arrays (<code>int32_t</code> and <code>int64_t</code>)</li>
<li>32-bit and 64-bit floats, scalars and and arrays (<code>float</code> and <code>double</code>)</li>
<li>Pointers are always casted into 64-bit integers, even on legacy 32-bit architectures</li>
<li>ASCII strings are represented as a pointers to character arrays
and terminated by a <code>'\0'</code> character (C convention).</li>
<li>Complex numbers can be represented by an array of 2 floats.</li>
<li>Boolean variables are stored as integers, <code>1</code> for <code>true</code> and <code>0</code> for <code>false</code></li>
<li>Floating point variables should be by default <code>double</code> unless explicitly mentioned</li>
<li>integers used for counting should always be <code>int64_t</code></li>
</ul>

<p>
To facilitate the  use in other languages than C, we will provide some
bindings in other languages in other repositories.
</p>
</div>
</div>

<div id="outline-container-org09d5623" class="outline-3">
<h3 id="org09d5623"><span class="section-number-3">2.8</span> Global state</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Global variables should  be avoided in the library,  because it is
possible that one  single program needs to  use multiple instances
of the library. To solve this  problem we propose to use a pointer
to  a   <a href="./qmckl_context.html"><code>context</code></a> variable,  built   by  the  library   with  the
<code>qmckl_context_create</code> function. The <a id="orgcfafd8c">=context=</a> contains the global
state of  the library, and is  used as the first  argument of many
QMCkl functions.
</p>

<p>
The internal structure of the context  is not specified, to give a
maximum of  freedom to  the different  implementations.  Modifying
the  state   is  done   by  setters   and  getters,   prefixed  by
<code>qmckl_set_</code>  an  <code>qmckl_get_</code>.
</p>
</div>
</div>

<div id="outline-container-org2de979b" class="outline-3">
<h3 id="org2de979b"><span class="section-number-3">2.9</span> Headers</h3>
<div class="outline-text-3" id="text-2-9">
<p>
A single <code>qmckl.h</code> header to be distributed by the library
is built by concatenating some of the produced header files.
To facilitate building the <code>qmckl.h</code> file, we separate types from
function declarations in headers. Types should be defined in header
files suffixed by <code>_type.h</code>, and functions in files suffixed by
<code>_func.h</code>.
As these files will be concatenated in a single file, they should
not be guarded by <code>#ifndef *_H</code>, and they should not include other
produced headers.
</p>

<p>
Some particular types that are not exported need to be known by the
context, and there are some functions to update instances of these
types contained inside the context. For example, a
<code>qmckl_numprec_struct</code> is present in the context, and the function
<code>qmckl_set_numprec_range</code> takes a context as a parameter, and set a
value in the <code>qmckl_numprec_struct</code> contained in the context.
Because of these intricate dependencies, a private header is
created, containing the <code>qmckl_numprec_struct</code>. This header is
included in the private header file which defines the type of the
context. Header files for private types are suffixed by <code>_private_type.h</code>
and header files for private functions are suffixed by <code>_private_func.h</code>.
Fortran interfaces should also be written in the <code>*fh_func.f90</code> file,
and the types definitions should be written in the <code>*fh_type.f90</code> file.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-left">Scope</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>*_type.h</code></td>
<td class="org-left">Public</td>
<td class="org-left">Type definitions</td>
</tr>

<tr>
<td class="org-left"><code>*_func.h</code></td>
<td class="org-left">Public</td>
<td class="org-left">Function definitions</td>
</tr>

<tr>
<td class="org-left"><code>*_private_type.h</code></td>
<td class="org-left">Private</td>
<td class="org-left">Type definitions</td>
</tr>

<tr>
<td class="org-left"><code>*_private_func.h</code></td>
<td class="org-left">Private</td>
<td class="org-left">Function definitions</td>
</tr>

<tr>
<td class="org-left"><code>*fh_type.f90</code></td>
<td class="org-left">Public</td>
<td class="org-left">Fortran type definitions</td>
</tr>

<tr>
<td class="org-left"><code>*fh_func.f90</code></td>
<td class="org-left">Public</td>
<td class="org-left">Fortran function definitions</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5da2472" class="outline-3">
<h3 id="org5da2472"><span class="section-number-3">2.10</span> Low-level functions</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Low-level functions are very simple  functions which are leaves of
the function call tree (they don't call any other QMCkl function).
</p>

<p>
These  functions   are   <i>pure</i>,   and  unaware   of   the   QMCkl
<a href="#orgcfafd8c"><code>context</code></a>. They are not allowed to allocate/deallocate memory, and
if they need temporary memory it should be provided in input.
</p>
</div>
</div>

<div id="outline-container-org210aa1f" class="outline-3">
<h3 id="org210aa1f"><span class="section-number-3">2.11</span> High-level functions</h3>
<div class="outline-text-3" id="text-2-11">
<p>
High-level functions  are at  the top of  the function  call tree.
They  are  able  to  choose which  lower-level  function  to  call
depending on the required precision, and do the corresponding type
conversions.  These functions are  also responsible for allocating
temporary storage, to simplify the use of accelerators.
</p>

<p>
The high-level  functions should be pure,  unless the introduction
of non-purity is justified. All the side effects should be made in
the <a href="#orgcfafd8c"><code>context</code></a> variable.
</p>
</div>
</div>
