qmckl.html

<div id="outline-container-org0176a87" class="outline-3">
<h3 id="org0176a87"><span class="section-number-3">2.12</span> Numerical precision</h3>
<div class="outline-text-3" id="text-2-12">
<p>
The number of bits of precision  required for a function should be
given as an input of low-level computational functions. This input
will be used to define the values of the different thresholds that
might be  used to  avoid computing unnecessary  noise.  High-level
functions  will  use  the  precision specified  in  the  <a href="#orgcfafd8c"><code>context</code></a>
variable.
</p>

<p>
In order to automatize numerical accuracy tests, QMCkl uses
<a href="https://github.com/verificarlo/verificarlo">Verificarlo</a> and
its CI functionality. You can read Verificarlo CI's documentation
at the <a href="https://github.com/verificarlo/verificarlo/blob/master/doc/06-Postprocessing.md#verificarlo-ci">following link</a>.
Reading it is advised to understand the remainder of this section.
</p>

<p>
To enable support for Verificarlo CI tests when building the
library, use the following configure command :
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #a0522d;">QMCKL_DEVEL</span>=1 ./configure --prefix=$<span style="color: #a0522d;">PWD</span>/_install --enable-silent-rules --enable-maintainer-mode <span style="color: #a0522d;">CC</span>=verificarlo-f <span style="color: #a0522d;">FC</span>=verificarlo-f --host=x86_64 --enable-vfc_ci
</pre>
</div>

<p>
Note that this does require an install of Verificarlo <b>with
Fortran support</b>. Enabling the support for CI will define the
<code>VFC_CI</code> preprocessor variable which use will be explained now.
</p>

<p>
As explained in the documentation, Verificarlo CI uses a probes
system to export variables from test programs to the tools itself.
To make tests easier to use, QMCkl has its own interface to the
probes system. To make the system very easy to use, these functions
are always defined, but will behave differently depending on the
<code>VFC_CI</code> preprocessor variable. There are 3 functions at your
disposal. When the CI is enabled, they will place a <code>vfc_ci</code> probe
as if calling <code>vfc_probes</code> directly. Otherwise, they will either do
nothing or perform a check on the tested value and return its result
as a boolean that you are free to use or ignore.
Here are these 3 functions :
</p>

<ul class="org-ul">
<li><code>qmckl_probe</code> : place a normal probe witout any check. Won't do anything when <code>vfc_ci</code> is disabled (false is returned).</li>
<li><code>qmckl_probe_check</code> : place a probe with an absolute check. If <code>vfc_ci</code> is disabled, this will return the result of an absolute check (|val - ref| &lt; accuracy target ?). If the check fails, true is returned (false otherwise).</li>
<li><code>qmckl_probe_check_relative</code> : place a probe with a relative check. If <code>vfc_ci</code> is disabled, this will return the result of a relative check (|val - ref| / ref &lt; accuracy target?). If the check fails, true is returned (false otherwise).</li>
</ul>


<p>
If you need more details on these functions or their Fortran
interfaces, have a look at the <code>tools/qmckl_probes</code> files.
</p>

<p>
Finally, if you need to add a QMCkl kernel to the CI tests
or modify an existing one, you should pay attention to the
following points :
</p>

<ul class="org-ul">
<li>you should add the new kernel to the <code>vfc_tests_config.json</code> file, which controls the backends and repetitions for each executable. More details can be found in the <code>vfc_ci</code> documentation.</li>

<li>in order to call the <code>qmckl_probes</code> functions from Fortran, import the <code>qmckl_probes_f</code> module.</li>

<li>if your tests include some asserts that rely on accurate FP values, you should probably wrap them inside a <code>#ifndef VFC_CI</code> statement, as the asserts would otherwise risk to fail when executed with the different Verificarlo backends.</li>
</ul>
</div>
</div>

<div id="outline-container-org92c22d5" class="outline-3">
<h3 id="org92c22d5"><span class="section-number-3">2.13</span> Algorithms</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Reducing the scaling of an  algorithm usually implies also reducing
its arithmetic  complexity (number  of flops per  byte). Therefore,
for  small  sizes   \(\mathcal{O}(N^3)\)  and  \(\mathcal{O}(N^2)\)
algorithms are  better adapted than linear  scaling algorithms.  As
QMCkl is a  general purpose library, multiple  algorithms should be
implemented adapted to different problem sizes.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX CoE</p>
<p class="date">Created: 2021-10-17 Sun 16:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
